{
	"version": "https://jsonfeed.org/version/1",
	"title": "Lia's Library",
	"icon": "https://micro.blog/emiabo/avatar.jpg",
	"home_page_url": "https://library.emiabo.com/",
	"feed_url": "https://library.emiabo.com/feed.json",
	"items": [
		
			{
				"id": "http://emiabo.micro.blog/2023/03/11/theatrhythm-final-bar.html",
				
				"content_html": "<p>🎮 Theatrhythm Final Bar Line (2023) - ★★★★☆</p>\n<p>Not a big FF person outside the MMO but this goes hard. Kinda hoping someone will either mod this or make an open source clone a la Osu/StepMania for even more charts&hellip;</p>\n",
				"content_text": "🎮 Theatrhythm Final Bar Line (2023) - ★★★★☆\n\nNot a big FF person outside the MMO but this goes hard. Kinda hoping someone will either mod this or make an open source clone a la Osu/StepMania for even more charts...\n",
				"date_published": "2023-03-11T22:33:32-07:00",
				"url": "https://library.emiabo.com/2023/03/11/theatrhythm-final-bar.html"
			},
			{
				"id": "http://emiabo.micro.blog/2023/03/11/god-im-kicking.html",
				
				"content_html": "<p>God I’m kicking my high school self so hard for selling my New 3DS XL, was looking into getting one now to hack with the eShop closing and all and they’re all $250+ on eBay. and will only go up from there. Could get a non-New one for less but…the best or nothin</p>\n",
				"content_text": "God I’m kicking my high school self so hard for selling my New 3DS XL, was looking into getting one now to hack with the eShop closing and all and they’re all $250+ on eBay. and will only go up from there. Could get a non-New one for less but…the best or nothin\n",
				"date_published": "2023-03-11T22:23:44-07:00",
				"url": "https://library.emiabo.com/2023/03/11/god-im-kicking.html"
			},
			{
				"id": "http://emiabo.micro.blog/2023/01/20/adventures-in-ai.html",
				"title": "🎨 Adventures in AI art",
				"content_html": "<!-- raw HTML omitted -->\n<p><em>Cover: <a href=\"https://unsplash.com/@ekrull?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Eric Krull</a> on <a href=\"https://unsplash.com/photos/Ejcuhcdfwrs?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash</a></em></p>\n<p>It&rsquo;s been a strange year to be a digital creative, or fan of them. First the NFT boom attempted to redefine art ownership into a harebrained scheme of artificial scarcity, then the past few months of your various social media feeds have been inundated with the creations of advanced text-to-image AI models, creators decrying them, and tech evangelists handwaving the former group&rsquo;s concerns away as if they were Luddites.</p>\n<p>Broadly, I am on the critics' side here. As elitist and frankly pointless as the &ldquo;it&rsquo;s not <em>real</em> art&rdquo; argument sounds, it is true these so-called &ldquo;artificial intelligence&rdquo; tools don&rsquo;t see the world with emotion. They are all, at their core, just huge equations, informed by terabytes of questionably-gathered human creativity, that turn thing A (prompt) into thing B (images or more text) with a bit of randomness injected in that looks like creativity to an uninformed observer. As such, I really don&rsquo;t believe at this time that most halfway competent artists with a clear vision have to worry about rogue algorithms taking their jobs.</p>\n<p>That being said, the ethical travesty of training these models without almost any knowledge or permission by creators, some <em>deceased</em> creators no less, should never have been allowed. In an ideal world, it certainly shouldn&rsquo;t continue to occur. But convincing the likes of Microsoft (sponsor of OpenAI) to delete all existing models and go back to square one is just not going to happen now; they want returns on their investment. So what comes next?</p>\n<h2 id=\"the-platform-problem-to-ban-or-not-to-ban\">The platform problem: To ban or not to ban?</h2>\n<p>AI generated work has a nasty habit of completely taking over whatever online platform it&rsquo;s posted on. It&rsquo;s almost as if these platforms are already controlled by recommender algorithms that reward the frequent posting enabled by the speed of AI tools! Without any action, human artists will simply be unable to keep up. That being said, I don&rsquo;t think AI generations should be banned entirely from large platforms. Smaller, focused communities are one thing, but if everywhere is off limits, bad actors will undoubtedly try to get away with posting it anyway. Since the few surefire tells of AI will disappear as the tech improves, witch hunting for anything that <em>looks</em> a little too AI generated could proliferate, hurting real creators in the process.</p>\n<p>For now, the best thing art sharing platforms could do is relegate it to its own section or tag, that people can easily hide (or even hide it by default), and require all posts to link back to the generator, prompt, exact settings used, and time of creation. That way, for instance, the model could be reviewed if it duplicates an existing work too closely.</p>\n<p>Finally, platforms should have a clear policy on AI training that <strong>opts out all users by default</strong>. Seriously, don&rsquo;t be DeviantArt or ArtStation. Sites made <em>for</em> artists should have the most responsibility to protect artists. If you spent all that time protecting against right-click-saves of NFTs, figure out how to do the same against unauthorized data scrapers for AI. The end result will be a much smaller dataset available, but in any field of science, the ethical path is never without sacrifices.</p>\n<h2 id=\"toy-or-tool-reviewing-novelai\">Toy or tool? Reviewing NovelAI</h2>\n<p>Since these tools aren&rsquo;t going anywhere, I decided to play around with a few popular AI tools to see if there&rsquo;s any merit to lightly AI-assisted creativity, or if prompt-wrangling is more effort than it&rsquo;s worth. A few months back I discovered <a href=\"https://novelai.net/\">NovelAI</a>, initially through their admittedly impressive anime-focused text to image model, but their core service is a fiction co-writing tool that seemed perfect for salvaging my aging collection of bizarre short story ideas from dreams I had. I signed up for their $15/mo middle tier, and got to work.</p>\n<h3 id=\"story-writing\">Story writing</h3>\n<!-- raw HTML omitted -->\n<p><em>The NovelAI interface.</em></p>\n<p>After completing the site&rsquo;s basic tutorial and digging into the Euterpe model&rsquo;s dizzying array of options and parameters, my first attempt at a story was a sci-fi thriller about a town where the night sky is suddenly replaced with a Windows blue screen-like error message, causing the townspeople to slowly discover they are in a computer simulation that is about to be reset. The idea originated from the LOCAL58 video <a href=\"https://www.youtube.com/watch?v=M75VLQuFPrY\">Weather Service</a>. For a brief time after watching this, my mind raced at night about what could be right outside my closed bedroom curtains. I&rsquo;ve shelved it for now because it was just too abstract a story based on such a distant and inexplicable fear, so any attempt at verbalizing it turned it into something else.</p>\n<p>However, this did force me to learn the ins and outs of AI co-writing, that the site doesn&rsquo;t teach you. Tags and summaries in your story&rsquo;s metadata, separating scenes, using the &ldquo;Lorebook&rdquo; tool to save descriptions of nouns, experimenting with presets that change the output, all of these have been carefully documented by the NovelAI community. The one thing I wasn&rsquo;t doing, though, was just writing. When you present me with all these options, of course I&rsquo;ll want to get all of them perfect before starting! This is the writing equivalent of spending the first 2 hours of a PC game tinkering with graphics settings for the best performance! It doesn&rsquo;t help that whenever I <em>tried</em> to use the AI, I already had an idea for where the story was going next, so it inevitably wrote in a direction I didn&rsquo;t want or got characters and concepts all mixed up. In that sense it is like having a co-writer: it can&rsquo;t read your mind, so taking time to explain context is paramount. Except here, explaining could happen in four different text boxes and half the time it spits your words back out at you or forgets which way is up. Supposedly their newer, fancier model Krake is a bit better with this stuff, but I can&rsquo;t really drop $25/mo to find out.</p>\n<p>My second story, you may have seen already! &ldquo;Maizie in the Mountains: A Holiday Adventure&rdquo; was almost entirely written by me. A fairytale story featuring our real cat, I wrote it as a Christmas gift complete with a pixel art cover. By this point I had begun using the &ldquo;Author&rsquo;s Note&rdquo; field to rein in Euterpe&rsquo;s outputs within a scene. This is discouraged in the community because the newer models weren&rsquo;t trained with this data field so they can break, but for my purposes it was the single most useful tip for taming the AI dream logic into something useful.</p>\n<p>There&rsquo;s much more ground to explore here, so I may keep my sub going a few more months and write a few more things in it. It seems that NovelAI was at least partially made as a successor to AI Dungeon, going so far as to introduce a &ldquo;text adventure&rdquo; mode and allow importing scenarios from that game, and many of the default prompts incorporate fantasy tropes and LitRPG-style character sheets. The devs are also clearly&hellip;enthusiasts for Japanese pop culture, providing several text generator modules not-so-subtly trained on the likes of the <em>Monogatari</em> series, <em>Spice and Wolf</em>, <em>Sword Art Online</em> and some undiscernable isekai series. Not to mention, as members of the official subreddit will bring up, it is one of the only tools on the market now that allows uncensored NSFW content creation, many a weeb&rsquo;s favorite pastime&hellip;</p>\n<p>So far, for most fiction writers, I can only really recommend this as a brainstorming tool. If you have the first few sentences, but have totally hit a wall, maybe it&rsquo;ll give you a spark. But once the plot beats are all in your head, it&rsquo;s nearly always easier to just write them down yourself and revise the wording later. The developers clearly seem to understand the limitations of current text models, which is why they designed this as a back-and-forth co-writing tool that encourages users to take what works and replace what doesn&rsquo;t in the GPT word salad. But the competition is fierce, with venture-backed tools like <a href=\"https://www.sudowrite.com/\">Sudowrite</a> allowing not only generation of new text but AI-powered <em>rewriting</em> of passages in a variety of stylistic directions. (It also claims to offer AI &ldquo;beta readers&rdquo; emblazoned with the likenesses of real dead authors, which seems a bit&hellip;yikes).</p>\n<h3 id=\"image-generation\">Image generation</h3>\n<p><em>Note: To see the images in this section, read on my blog!</em></p>\n<p>Enough about boring fiction! Almost <em>all</em> the attention NovelAI has received has been in the months since they launched their own contender in the diffusion image generator wars, with a remarkable knack for anime characters. It was trained from imageboard <a href=\"https://safebooru.donmai.us/\">Danbooru</a>, and its resulting tag-based prompt system sets it apart from the mainstream tools like DALL-E or Midjourney. Rather than a plain English prompt (&ldquo;An illustration of a tabby cat laying in a meadow in an impressionist style&rdquo;), a NAI prompt is more like &ldquo;1girl, medium brown hair, green eyes, sweater, orange background&rdquo;. As someone always on the lookout for character creators, I naturally couldn&rsquo;t resist.</p>\n<!-- raw HTML omitted -->\n<p>My first couple generations weren&rsquo;t bad, but kind of bland. Some hardcore users spend hours tinkering on the order of tags, <code>{{{emphasizing}}}</code> some and <code>[[[demoting]]]</code> others, but I haven&rsquo;t really had the time, patience, or generator credits for that, so eventually I started feeding in old avatars (sorry I lost the source for most) through the image-to-image mode. A few of the resulting artstyle changes were actually kinda cute!</p>\n<!-- raw HTML omitted -->\n<p>At this point the drawbacks were becoming more apparent, though. The strange artifacts and uncomfortable anatomy, for one thing. These can mostly be retouched by hand later, but the bigger issue is limited capacity for defining multiple characters at once, or defining backgrounds in general. The tags just don&rsquo;t allow for that kind of granularity. The reason I kept all of these on solid-color backdrops is so I could composite them atop one later.</p>\n<p>Look, I was going to do more with this, given its popularity means it will probably be NovelAI&rsquo;s bread and butter going forward, but honestly these image generators have already become so commonplace that they don&rsquo;t interest me as much as the text space. Maybe my opinion on this tool would evolve with more usage, but for now, if I&rsquo;m in an artistic mood, I think I&rsquo;d rather sketch something in my own style (even if it&rsquo;s garbage) than play this exhausting game with prompts and sliders.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Just in the month I&rsquo;ve been writing this, the craze continues to evolve. <a href=\"https://beta.character.ai/\">Character.AI</a> brings just as much humor from the &ldquo;AI greentext&rdquo; days as future questions about impersonation and parasociality. Meanwhile, there&rsquo;s the new reigning champ of text generators supposedly poised to &ldquo;kill the college essay&rdquo;, ChatGPT. I considered deep diving into those, but they&rsquo;re beyond the scope of what I wanted to say here about &ldquo;art&rdquo;, and honestly the world will soon be so inundated with bland AI-generated ad copy and blogspam that the situation will speak for itself. So for now, listen to some human-made music, watch a film, or admire some lovingly crafted pixel art. I think it&rsquo;ll be some time before robots crack the code on those.</p>\n<hr>\n<p>Legit I lost a week just trying to figure out an image gallery solution in Hugo for this piece, if they&rsquo;re broken forget it you know what AI art looks like</p>\n",
				"content_text": "<img src=\"uploads/2023/4ca2de70ed.jpg\" width=\"600\" height=\"350\" alt=\"Five colorful toy robots\" />\n\n*Cover: [Eric Krull](https://unsplash.com/@ekrull?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText) on [Unsplash](https://unsplash.com/photos/Ejcuhcdfwrs?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText)*\n\nIt's been a strange year to be a digital creative, or fan of them. First the NFT boom attempted to redefine art ownership into a harebrained scheme of artificial scarcity, then the past few months of your various social media feeds have been inundated with the creations of advanced text-to-image AI models, creators decrying them, and tech evangelists handwaving the former group's concerns away as if they were Luddites.\n\nBroadly, I am on the critics' side here. As elitist and frankly pointless as the \"it's not *real* art\" argument sounds, it is true these so-called \"artificial intelligence\" tools don't see the world with emotion. They are all, at their core, just huge equations, informed by terabytes of questionably-gathered human creativity, that turn thing A (prompt) into thing B (images or more text) with a bit of randomness injected in that looks like creativity to an uninformed observer. As such, I really don't believe at this time that most halfway competent artists with a clear vision have to worry about rogue algorithms taking their jobs.\n\nThat being said, the ethical travesty of training these models without almost any knowledge or permission by creators, some *deceased* creators no less, should never have been allowed. In an ideal world, it certainly shouldn't continue to occur. But convincing the likes of Microsoft (sponsor of OpenAI) to delete all existing models and go back to square one is just not going to happen now; they want returns on their investment. So what comes next?\n## The platform problem: To ban or not to ban?\nAI generated work has a nasty habit of completely taking over whatever online platform it's posted on. It's almost as if these platforms are already controlled by recommender algorithms that reward the frequent posting enabled by the speed of AI tools! Without any action, human artists will simply be unable to keep up. That being said, I don't think AI generations should be banned entirely from large platforms. Smaller, focused communities are one thing, but if everywhere is off limits, bad actors will undoubtedly try to get away with posting it anyway. Since the few surefire tells of AI will disappear as the tech improves, witch hunting for anything that *looks* a little too AI generated could proliferate, hurting real creators in the process.\n\nFor now, the best thing art sharing platforms could do is relegate it to its own section or tag, that people can easily hide (or even hide it by default), and require all posts to link back to the generator, prompt, exact settings used, and time of creation. That way, for instance, the model could be reviewed if it duplicates an existing work too closely.\n\nFinally, platforms should have a clear policy on AI training that **opts out all users by default**. Seriously, don't be DeviantArt or ArtStation. Sites made *for* artists should have the most responsibility to protect artists. If you spent all that time protecting against right-click-saves of NFTs, figure out how to do the same against unauthorized data scrapers for AI. The end result will be a much smaller dataset available, but in any field of science, the ethical path is never without sacrifices.\n## Toy or tool? Reviewing NovelAI\nSince these tools aren't going anywhere, I decided to play around with a few popular AI tools to see if there's any merit to lightly AI-assisted creativity, or if prompt-wrangling is more effort than it's worth. A few months back I discovered [NovelAI](https://novelai.net/), initially through their admittedly impressive anime-focused text to image model, but their core service is a fiction co-writing tool that seemed perfect for salvaging my aging collection of bizarre short story ideas from dreams I had. I signed up for their $15/mo middle tier, and got to work.\n### Story writing\n<img src=\"uploads/2023/f7ca623275.png\" width=\"600\" height=\"292\" alt=\"A three-panel web interface with list of stories on the left, main story text in the center, and AI parameters on the right.\" />\n\n*The NovelAI interface.*\n\nAfter completing the site's basic tutorial and digging into the Euterpe model's dizzying array of options and parameters, my first attempt at a story was a sci-fi thriller about a town where the night sky is suddenly replaced with a Windows blue screen-like error message, causing the townspeople to slowly discover they are in a computer simulation that is about to be reset. The idea originated from the LOCAL58 video [Weather Service](https://www.youtube.com/watch?v=M75VLQuFPrY). For a brief time after watching this, my mind raced at night about what could be right outside my closed bedroom curtains. I've shelved it for now because it was just too abstract a story based on such a distant and inexplicable fear, so any attempt at verbalizing it turned it into something else.\n\nHowever, this did force me to learn the ins and outs of AI co-writing, that the site doesn't teach you. Tags and summaries in your story's metadata, separating scenes, using the \"Lorebook\" tool to save descriptions of nouns, experimenting with presets that change the output, all of these have been carefully documented by the NovelAI community. The one thing I wasn't doing, though, was just writing. When you present me with all these options, of course I'll want to get all of them perfect before starting! This is the writing equivalent of spending the first 2 hours of a PC game tinkering with graphics settings for the best performance! It doesn't help that whenever I *tried* to use the AI, I already had an idea for where the story was going next, so it inevitably wrote in a direction I didn't want or got characters and concepts all mixed up. In that sense it is like having a co-writer: it can't read your mind, so taking time to explain context is paramount. Except here, explaining could happen in four different text boxes and half the time it spits your words back out at you or forgets which way is up. Supposedly their newer, fancier model Krake is a bit better with this stuff, but I can't really drop $25/mo to find out.\n\nMy second story, you may have seen already! \"Maizie in the Mountains: A Holiday Adventure\" was almost entirely written by me. A fairytale story featuring our real cat, I wrote it as a Christmas gift complete with a pixel art cover. By this point I had begun using the \"Author's Note\" field to rein in Euterpe's outputs within a scene. This is discouraged in the community because the newer models weren't trained with this data field so they can break, but for my purposes it was the single most useful tip for taming the AI dream logic into something useful.\n\nThere's much more ground to explore here, so I may keep my sub going a few more months and write a few more things in it. It seems that NovelAI was at least partially made as a successor to AI Dungeon, going so far as to introduce a \"text adventure\" mode and allow importing scenarios from that game, and many of the default prompts incorporate fantasy tropes and LitRPG-style character sheets. The devs are also clearly...enthusiasts for Japanese pop culture, providing several text generator modules not-so-subtly trained on the likes of the *Monogatari* series, *Spice and Wolf*, *Sword Art Online* and some undiscernable isekai series. Not to mention, as members of the official subreddit will bring up, it is one of the only tools on the market now that allows uncensored NSFW content creation, many a weeb's favorite pastime...\n\nSo far, for most fiction writers, I can only really recommend this as a brainstorming tool. If you have the first few sentences, but have totally hit a wall, maybe it'll give you a spark. But once the plot beats are all in your head, it's nearly always easier to just write them down yourself and revise the wording later. The developers clearly seem to understand the limitations of current text models, which is why they designed this as a back-and-forth co-writing tool that encourages users to take what works and replace what doesn't in the GPT word salad. But the competition is fierce, with venture-backed tools like [Sudowrite](https://www.sudowrite.com/) allowing not only generation of new text but AI-powered *rewriting* of passages in a variety of stylistic directions. (It also claims to offer AI \"beta readers\" emblazoned with the likenesses of real dead authors, which seems a bit...yikes).\n### Image generation\n*Note: To see the images in this section, read on my blog!*\n\nEnough about boring fiction! Almost *all* the attention NovelAI has received has been in the months since they launched their own contender in the diffusion image generator wars, with a remarkable knack for anime characters. It was trained from imageboard [Danbooru](https://safebooru.donmai.us/), and its resulting tag-based prompt system sets it apart from the mainstream tools like DALL-E or Midjourney. Rather than a plain English prompt (\"An illustration of a tabby cat laying in a meadow in an impressionist style\"), a NAI prompt is more like \"1girl, medium brown hair, green eyes, sweater, orange background\". As someone always on the lookout for character creators, I naturally couldn't resist.\n\n<div class=\"img-gallery\">\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/79c5ad9b4c.png\" gallery=\"nai-prompted\" title=\"\" description=\"portrait, 1girl, looking at viewer, light brown hair, green eyes, blue V-neck sweater\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/\" gallery=\"nai-prompted\" title=\"Notice the weird eyebrow hair and collar stitching\" description=\"portrait, 1girl, looking at viewer, medium hair in half bun, light brown hair, green eyes, gray turtleneck sweater\" >}}\n</div>\n\nMy first couple generations weren't bad, but kind of bland. Some hardcore users spend hours tinkering on the order of tags, `{{{emphasizing}}}` some and `[[[demoting]]]` others, but I haven't really had the time, patience, or generator credits for that, so eventually I started feeding in old avatars (sorry I lost the source for most) through the image-to-image mode. A few of the resulting artstyle changes were actually kinda cute!\n\n<div class=\"img-gallery\">\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/fd9ab37830.png\" gallery=\"nai-img2img\" title=\"Original from a picrew.me character creator - sorry I lost the link!\" description=\"long lavender hair in half ponytail, red eyes, facial scar, red blazer, choker, giving backward peace sign with purple mail polish\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/0db3583fc3.png\" gallery=\"nai-img2img\" title=\"oh god broken neck\" description=\"same as above but hair is now braided at sides and choker faces opposite the curve of her neck\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/d6fac2702e.png\" gallery=\"nai-img2img\" title=\"Better!\" description=\"choker direction is back to normal and blazer now has gold trim\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/e5efd5311f.png\" gallery=\"nai-img2img\" title=\"Original from a picrew.me character creator - sorry I lost the link!\" description=\"long lavender hair with green eyes, white choker, headphones and purple sweater and collared shirt with bow\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/611770f455.png\" gallery=\"nai-img2img\" title=\"\" description=\"largely the same but headphones are now green\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/7265f270a9.png\" gallery=\"nai-img2img\" title=\"Notice the half headphone\" description=\"added one headphone earcup around neck by bow\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/333863a060.png\" gallery=\"nai-img2img\" title=\"\" description=\"headphone has been replaced by blue hairband\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/d11a1fc4a7.jpg\" gallery=\"nai-img2img\" title=\"Original from a picrew.me character creator - sorry I lost the link!\" description=\"chibi style girl with long brown hair and pink backlighting, wearing headphones and holding boba tea in one hand and phone in other\" >}}\n  {{<glightbox src=\"https://emiabo.micro.blog/uploads/2023/f67315b4b8.png\" gallery=\"nai-img2img\" title=\"Interesting artstyle change!\" description=\"artstyle is looser, headphones gone and phone has been replaced by two neon gradient drinks in both hands\" >}}\n</div>\n\nAt this point the drawbacks were becoming more apparent, though. The strange artifacts and uncomfortable anatomy, for one thing. These can mostly be retouched by hand later, but the bigger issue is limited capacity for defining multiple characters at once, or defining backgrounds in general. The tags just don't allow for that kind of granularity. The reason I kept all of these on solid-color backdrops is so I could composite them atop one later.\n\nLook, I was going to do more with this, given its popularity means it will probably be NovelAI's bread and butter going forward, but honestly these image generators have already become so commonplace that they don't interest me as much as the text space. Maybe my opinion on this tool would evolve with more usage, but for now, if I'm in an artistic mood, I think I'd rather sketch something in my own style (even if it's garbage) than play this exhausting game with prompts and sliders.\n## Conclusion\nJust in the month I've been writing this, the craze continues to evolve. [Character.AI](https://beta.character.ai/) brings just as much humor from the \"AI greentext\" days as future questions about impersonation and parasociality. Meanwhile, there's the new reigning champ of text generators supposedly poised to \"kill the college essay\", ChatGPT. I considered deep diving into those, but they're beyond the scope of what I wanted to say here about \"art\", and honestly the world will soon be so inundated with bland AI-generated ad copy and blogspam that the situation will speak for itself. So for now, listen to some human-made music, watch a film, or admire some lovingly crafted pixel art. I think it'll be some time before robots crack the code on those.\n\n---\nLegit I lost a week just trying to figure out an image gallery solution in Hugo for this piece, if they're broken forget it you know what AI art looks like\n",
				"date_published": "2023-01-20T10:00:00-07:00",
				"url": "https://library.emiabo.com/2023/01/20/adventures-in-ai.html",
				"tags": ["essay"]
			},
			{
				"id": "http://emiabo.micro.blog/2023/01/19/maizie-in-the.html",
				"title": "📝 Maizie in the Mountains: A Holiday Adventure",
				"content_html": "<!-- raw HTML omitted -->\n<p><strong>Originally published Dec 22, 2022</strong></p>\n<p>Once upon a time, there was a curious kitten named Maizie. Along with her mother and siblings, she lived in an old house on a quiet hillside. Although the cats had lots of room to play and explore amidst the evergreen trees, their mother didn&rsquo;t always have the best luck with catching food, and winters were especially difficult. The other critters hibernated when the snow fell, and there was little left for the family to eat except the spiders that lived in their attic.</p>\n<p>One frigid day, the kittens' mother came home from hunting empty-handed and put her head down by her water bowl to drink up before getting ready for bed. The bowl, really a plastic takeout container, was pushed against a corner so that it collected the drippings of the snow-covered roof above. The cool water refreshed the feline&rsquo;s thirst, and not long after, her family carefully hopped down the stairs to hear the news about her catches.</p>\n<p>&ldquo;Ma!&rdquo; meowed Garth excitedly. &ldquo;Did ya bring back any fish? Mice? Birds?&rdquo;</p>\n<p>&ldquo;Sadly, the river has finally frozen over, the ground critters are going to sleep for the winter, and the birds have mostly flown south. Looks like we&rsquo;ll be having the flies for dinner again&rdquo; replied Ma. The freshly fallen snow didn&rsquo;t feel great under her aging paws, either.</p>\n<p>&ldquo;Aww&hellip;&rdquo; Garth had only just recently begun to eat solid food, but he had already become quite the little gourmet. His favorite food so far was rabbit, although Ma was only lucky enough to run into one once.</p>\n<p>&ldquo;Cheer up, Garth&rdquo; Maizie said as she trotted up behind them. &ldquo;They&rsquo;re really fun to catch at least! We&rsquo;d be a lot worse off if I hadn&rsquo;t found them.&rdquo; Ma had, actually, but decided to let the kitten have her satisfaction. The cats headed upstairs, keeping their eyes and ears peeled for buzzing bees and crawling creatures. After dinner, they tucked into the attic, cushioned with old blankets left on the floor, and they fell asleep to the lullaby of gusting wind.</p>\n<hr>\n<p>A bright light and jingling bells awoke Maizie from her slumber. Being the most vigilant of the litter, she quietly arose and approached the window, standing on her hind legs to survey the scene. The forest outside the window was filled with fir trees, dusted with powdery snow. Maizie&rsquo;s stomach growled after her lackluster supper. She decided to return to bed and warm up with the others, but at that moment, she spotted a small creature moving quickly between the trees. A squirrel! Or so she thought as she nearly leapt for the door and began in pursuit of it. Ma would be upset with her for wandering out alone, but the tasty rodent would surely make up for it!</p>\n<p>As Maizie closed in on the creature, she noticed it looked quite different from the ones Ma had brought back before. It was running on two legs, had smooth and shiny skin rather than fur, the top of its head was pointy and green, and strangest of all, its eyes were glowing like moonlight onto the ground ahead of it. It huffed and puffed as its spindly legs struggled through the snow, giving Maizie an opening to pounce! She trapped the creature between her brown paws.</p>\n<p>&ldquo;Wait! Don&rsquo;t eat me!!&rdquo; the creature yelped. Somehow, Maizie could understand it, and she meowed back in surprise. &ldquo;What are you? You&rsquo;re not a squirrel!&rdquo;</p>\n<p>&ldquo;What? No, I&rsquo;m a delivery elf! And I have to get to town and get back on Santa&rsquo;s sleigh!&rdquo; He managed to wriggle out of Maizie&rsquo;s grip for a moment, but she handily caught his leg. &ldquo;Let me go, kitty!&rdquo;</p>\n<p>&ldquo;Who&rsquo;s this Santa anyway?&rdquo; Maizie was already disappointed. This&hellip;thing seemed more mechanical than meat. Her mother would think she had run off to chase a toy!</p>\n<p>&ldquo;You don&rsquo;t know? Well, I suppose you are a stray, and in this far-off forest no less. Tonight is Christmas, a very special night. A jolly old human called Santa brings gifts to all the children who&rsquo;ve been good this year. Not just other humans, but dogs and cats like you, too! The people think he slinks down their chimneys one by one and deposits gifts under their trees, but that would take far too long, so his workshop builds thousands of mechanical delivery elves like us!&rdquo;</p>\n<p>&ldquo;Where are you going, then? There&rsquo;s not many people out in this forest.&rdquo; Maizie&rsquo;s mother had told the kittens all about humans. They walked on two legs, kept cats in their houses, and served up food every day. Sounded like a nice life, but Ma must have had her reasons for running away.</p>\n<p>&ldquo;Santa has to land for a few minutes in every town so we can all deliver to our assigned houses and get back on the sleigh. But I&rsquo;ve been left behind! If I don&rsquo;t get to the next town soon, I&rsquo;ll never catch up!&rdquo; His panicked expression softened a bit. &ldquo;Say, you can run through the snow much faster than I can. If you&rsquo;d give me a ride to town, I&rsquo;m sure Santa would be happy to give you a gift, too!&rdquo;</p>\n<hr>\n<p>Even though Maizie was the fastest runner of her litter, her short fur provided little protection from the cold breeze stiffening her bones as the pair approached the lights of town. &ldquo;Say,&rdquo; the kitten wondered aloud, &ldquo;how come I can understand you? I&rsquo;ve never seen a live mouse or fish that could speak cat!&rdquo;</p>\n<p>&ldquo;So we can talk to the humans' pets if they catch us while we&rsquo;re delivering!&rdquo; the elf exclaimed, trying his best to hold on. He had lost many a comrade to rogue dogs before this feature was made standard. &ldquo;Don&rsquo;t stress the specifics, it&rsquo;s just to make sure the people aren&rsquo;t woken up at any cost!&rdquo;</p>\n<p>Exiting the forest, there were more houses than Maizie had ever seen in one place before. They came in all shapes and sizes, and a few even had light pouring out their windows - a sure sign of humans! Her pace slowed as she approached a distinct break in the snow cover: a road, which Ma had taught her was one of the most dangerous places for a cat. Huge, loud creatures with four or even more wheels could come screaming across at any time! It seemed quiet now, though, so she carefully crossed.</p>\n<p>Turning a corner between the rows of homes, Maizie was presented with an astonishing sight. A tall, lone tree stood in a paved square, breaking up the rows of buildings. In many ways it looked just like the many others that dotted the forest she had just left, but unlike those, it shimmered with lights all along its boughs! Before it was a large red sleigh carrying a burlap sack, surrounded by carefully wrapped gift boxes carried by the elves single-file like a colony of ants. &ldquo;Ah, that&rsquo;s a relief,&rdquo; the elf said, &ldquo;I wasn&rsquo;t sure if this was a drop point! Santa only lands in towns where there&rsquo;s a Christmas tree in a public place, like this one.&rdquo;</p>\n<p>The pair continued through the streets, passing more colorfully decorated houses. They looked so warm&hellip;Maizie had been running in the cold without food this whole time, and wasn&rsquo;t going to hold out much longer. Suddenly, she slipped on a patch of ice and took a tumble, coating her paws, face, and chest with snow, and there she laid for a long while.</p>\n<p>&ldquo;Kitty! We can do this, it&rsquo;s just one more block!&rdquo; The clockwork courier elf had returned to his feet after being thrown off, unaffected by the cold. He pushed Maizie up on her four paws, and walked close beside her as the two slowly approached the sleigh, which by this point was ready for takeoff.</p>\n<p>&ldquo;WAAAIT!! Santa!&rdquo; the elf used his remaining power to shout as he jumped up right onto the front of the sleigh. &ldquo;This stray kitten here! We missed her house!&rdquo; Santa looked over at the cat, and the sleigh&rsquo;s reins nearly fell out of his gloved hands. He stepped out of the sleigh, and kneeled down to the frightened feline. &ldquo;Ho ho, no need to be so scared. It seems checking my list twice wasn&rsquo;t enough! I&rsquo;m afraid I don&rsquo;t have a gift wrapped and ready for you, but&hellip;&rdquo; &ndash; he pulled out a palm-sized gift box from his back pocket &ndash; &ldquo;that&rsquo;s why I keep a few of these. A magic gift box. With this, you can make one wish. That Christmas magic isn&rsquo;t easy to collect, you know, so use it wisely.&rdquo;</p>\n<p>Maizie, with her remaining strength, leaned in and sniffed the box in Santa&rsquo;s palm, pushing the lid off and revealing a spark of faintly red and green light. At that moment, she wished for her family to never go cold and hungry again. The one spark started to multiply into many, spiraling around her towards the sky. A few brushed up against the snow covering her, turning it into warm fur. Eventually the sparks fully encircled the feline, and just like that, she disappeared.</p>\n<p>Santa turned back towards the sleigh. &ldquo;Thank you for finding that little one. Don&rsquo;t tell the others, but the Silver Bell award might be in your future. Now, let&rsquo;s get back on schedule!&rdquo; The elf decided to take this in stride, not mentioning that he was just trying to catch up from missing the last stop. He pranced back into the elf quarters beneath the seat of the sleigh, and with Santa at the reins once again, the reindeer propelled them into the sky.</p>\n<hr>\n<p>When Maizie awoke, she was in a warm, plain room, perched on a carpeted tower alongside her siblings, and a few other cats were playing with toys in the same room. A large window provided a view outside: A concrete jungle, with scattered parked cars and people, and a backlit sign - &ldquo;Animal Shelter&rdquo;.\nMaizie&rsquo;s ears perked up as the door behind her opened.</p>\n<p><strong>The End</strong></p>\n<hr>\n<p>A Christmas story in January? This will make sense with my next post promise</p>\n",
				"content_text": "<img src=\"uploads/2023/4f240688e6.png\" width=\"480\" height=\"320\" alt=\"Pixel art of a tabby cat in snowy town at Christmas\" />\n\n**Originally published Dec 22, 2022**\n\nOnce upon a time, there was a curious kitten named Maizie. Along with her mother and siblings, she lived in an old house on a quiet hillside. Although the cats had lots of room to play and explore amidst the evergreen trees, their mother didn't always have the best luck with catching food, and winters were especially difficult. The other critters hibernated when the snow fell, and there was little left for the family to eat except the spiders that lived in their attic.\n\nOne frigid day, the kittens' mother came home from hunting empty-handed and put her head down by her water bowl to drink up before getting ready for bed. The bowl, really a plastic takeout container, was pushed against a corner so that it collected the drippings of the snow-covered roof above. The cool water refreshed the feline's thirst, and not long after, her family carefully hopped down the stairs to hear the news about her catches.\n\n\"Ma!\" meowed Garth excitedly. \"Did ya bring back any fish? Mice? Birds?\"\n\n\"Sadly, the river has finally frozen over, the ground critters are going to sleep for the winter, and the birds have mostly flown south. Looks like we'll be having the flies for dinner again\" replied Ma. The freshly fallen snow didn't feel great under her aging paws, either.\n\n\"Aww...\" Garth had only just recently begun to eat solid food, but he had already become quite the little gourmet. His favorite food so far was rabbit, although Ma was only lucky enough to run into one once.\n\n\"Cheer up, Garth\" Maizie said as she trotted up behind them. \"They're really fun to catch at least! We'd be a lot worse off if I hadn't found them.\" Ma had, actually, but decided to let the kitten have her satisfaction. The cats headed upstairs, keeping their eyes and ears peeled for buzzing bees and crawling creatures. After dinner, they tucked into the attic, cushioned with old blankets left on the floor, and they fell asleep to the lullaby of gusting wind.\n\n---\nA bright light and jingling bells awoke Maizie from her slumber. Being the most vigilant of the litter, she quietly arose and approached the window, standing on her hind legs to survey the scene. The forest outside the window was filled with fir trees, dusted with powdery snow. Maizie's stomach growled after her lackluster supper. She decided to return to bed and warm up with the others, but at that moment, she spotted a small creature moving quickly between the trees. A squirrel! Or so she thought as she nearly leapt for the door and began in pursuit of it. Ma would be upset with her for wandering out alone, but the tasty rodent would surely make up for it!\n\nAs Maizie closed in on the creature, she noticed it looked quite different from the ones Ma had brought back before. It was running on two legs, had smooth and shiny skin rather than fur, the top of its head was pointy and green, and strangest of all, its eyes were glowing like moonlight onto the ground ahead of it. It huffed and puffed as its spindly legs struggled through the snow, giving Maizie an opening to pounce! She trapped the creature between her brown paws.\n\n\"Wait! Don't eat me!!\" the creature yelped. Somehow, Maizie could understand it, and she meowed back in surprise. \"What are you? You're not a squirrel!\"\n\n\"What? No, I'm a delivery elf! And I have to get to town and get back on Santa's sleigh!\" He managed to wriggle out of Maizie's grip for a moment, but she handily caught his leg. \"Let me go, kitty!\"\n\n\"Who's this Santa anyway?\" Maizie was already disappointed. This...thing seemed more mechanical than meat. Her mother would think she had run off to chase a toy!\n\n\"You don't know? Well, I suppose you are a stray, and in this far-off forest no less. Tonight is Christmas, a very special night. A jolly old human called Santa brings gifts to all the children who've been good this year. Not just other humans, but dogs and cats like you, too! The people think he slinks down their chimneys one by one and deposits gifts under their trees, but that would take far too long, so his workshop builds thousands of mechanical delivery elves like us!\"\n\n\"Where are you going, then? There's not many people out in this forest.\" Maizie's mother had told the kittens all about humans. They walked on two legs, kept cats in their houses, and served up food every day. Sounded like a nice life, but Ma must have had her reasons for running away.\n\n\"Santa has to land for a few minutes in every town so we can all deliver to our assigned houses and get back on the sleigh. But I've been left behind! If I don't get to the next town soon, I'll never catch up!\" His panicked expression softened a bit. \"Say, you can run through the snow much faster than I can. If you'd give me a ride to town, I'm sure Santa would be happy to give you a gift, too!\"\n\n---\nEven though Maizie was the fastest runner of her litter, her short fur provided little protection from the cold breeze stiffening her bones as the pair approached the lights of town. \"Say,\" the kitten wondered aloud, \"how come I can understand you? I've never seen a live mouse or fish that could speak cat!\"\n\n\"So we can talk to the humans' pets if they catch us while we're delivering!\" the elf exclaimed, trying his best to hold on. He had lost many a comrade to rogue dogs before this feature was made standard. \"Don't stress the specifics, it's just to make sure the people aren't woken up at any cost!\"\n\nExiting the forest, there were more houses than Maizie had ever seen in one place before. They came in all shapes and sizes, and a few even had light pouring out their windows - a sure sign of humans! Her pace slowed as she approached a distinct break in the snow cover: a road, which Ma had taught her was one of the most dangerous places for a cat. Huge, loud creatures with four or even more wheels could come screaming across at any time! It seemed quiet now, though, so she carefully crossed.\n\nTurning a corner between the rows of homes, Maizie was presented with an astonishing sight. A tall, lone tree stood in a paved square, breaking up the rows of buildings. In many ways it looked just like the many others that dotted the forest she had just left, but unlike those, it shimmered with lights all along its boughs! Before it was a large red sleigh carrying a burlap sack, surrounded by carefully wrapped gift boxes carried by the elves single-file like a colony of ants. \"Ah, that's a relief,\" the elf said, \"I wasn't sure if this was a drop point! Santa only lands in towns where there's a Christmas tree in a public place, like this one.\"\n\nThe pair continued through the streets, passing more colorfully decorated houses. They looked so warm...Maizie had been running in the cold without food this whole time, and wasn't going to hold out much longer. Suddenly, she slipped on a patch of ice and took a tumble, coating her paws, face, and chest with snow, and there she laid for a long while.\n\n\"Kitty! We can do this, it's just one more block!\" The clockwork courier elf had returned to his feet after being thrown off, unaffected by the cold. He pushed Maizie up on her four paws, and walked close beside her as the two slowly approached the sleigh, which by this point was ready for takeoff.\n\n\"WAAAIT!! Santa!\" the elf used his remaining power to shout as he jumped up right onto the front of the sleigh. \"This stray kitten here! We missed her house!\" Santa looked over at the cat, and the sleigh's reins nearly fell out of his gloved hands. He stepped out of the sleigh, and kneeled down to the frightened feline. \"Ho ho, no need to be so scared. It seems checking my list twice wasn't enough! I'm afraid I don't have a gift wrapped and ready for you, but...\" -- he pulled out a palm-sized gift box from his back pocket -- \"that's why I keep a few of these. A magic gift box. With this, you can make one wish. That Christmas magic isn't easy to collect, you know, so use it wisely.\"\n\nMaizie, with her remaining strength, leaned in and sniffed the box in Santa's palm, pushing the lid off and revealing a spark of faintly red and green light. At that moment, she wished for her family to never go cold and hungry again. The one spark started to multiply into many, spiraling around her towards the sky. A few brushed up against the snow covering her, turning it into warm fur. Eventually the sparks fully encircled the feline, and just like that, she disappeared.\n\nSanta turned back towards the sleigh. \"Thank you for finding that little one. Don't tell the others, but the Silver Bell award might be in your future. Now, let's get back on schedule!\" The elf decided to take this in stride, not mentioning that he was just trying to catch up from missing the last stop. He pranced back into the elf quarters beneath the seat of the sleigh, and with Santa at the reins once again, the reindeer propelled them into the sky.\n\n---\nWhen Maizie awoke, she was in a warm, plain room, perched on a carpeted tower alongside her siblings, and a few other cats were playing with toys in the same room. A large window provided a view outside: A concrete jungle, with scattered parked cars and people, and a backlit sign - \"Animal Shelter\".\nMaizie's ears perked up as the door behind her opened.\n\n**The End**\n\n---\nA Christmas story in January? This will make sense with my next post promise\n",
				"date_published": "2023-01-19T10:00:00-07:00",
				"url": "https://library.emiabo.com/2023/01/19/maizie-in-the.html",
				"tags": ["fiction"]
			},
			{
				"id": "http://emiabo.micro.blog/2023/01/18/vtubers-and-famous.html",
				"title": "🎮 VTubers and famous anonymity",
				"content_html": "<!-- raw HTML omitted -->\n<p><strong>Originally published Nov 13, 2021</strong></p>\n<p>The term &ldquo;celebrity&rdquo; usually brings to mind famous faces, usually actors, musicians, comedians, people whose work necessarily means exposing some aspect of their likeness to the world. This often means egregious invasions of privacy are not uncommon in this crowd, through paparazzi, leaked private photos and conversations, and so on. This isn’t always bad, particularly when it reveals real harmful acts toward others that otherwise would not have come to light. But in general, for people who gain visible fame (in the US anyway), it just takes the form of putting on disguises to go to the gym and watching for cameras/mics around every turn; a daily reminder of people’s obsessive need to understand the person behind the mask.</p>\n<p>Internet celebrity presents somewhat of a new paradigm, with content creators that, while still commercializing their likeness and giving up privacy for a living, through regular fan interactions they reduce the perception of perfection, paving the way for parasociality. The spectrum ranges from Instagram influencers at perhaps the most distant and traditional in their approach to fame, to YouTubers interacting with commenters to influence the direction of their next video, and finally streamers chatting with viewers in near real-time. Add in the expectation of regular Twitter updates and off the cuff quips, and you’ve got a powerful engine for thousands of fans not just considering you an idol, but a friend (and all the risks that come with that).</p>\n<p>Gaining enough followers to be a full-time streamer takes work, though, and it’s not something most people can afford to drop everything and do, not to mention the risk of having your real name and future career tarnished if you mess up bad online. It sure would be nice to be able to try out being an online entertainer while retaining a certain amount of privacy. You could just stream or write videos under a pseudonym and not show your face, but then a certain degree of nuance is lost without the audience seeing your candid reactions. It also would be nice to have some tried-and-true formulas for content, and a built-in audience when starting out. Enter VTubing.</p>\n<h2 id=\"history-time\">History time</h2>\n<p>For those not in the know, here’s a quick rundown of the history of virtual YouTubing, or vlogging/streaming with a motion capture avatar. As early as 2011, a YouTuber named Ami Yamato was publishing animated vlogs; while some consider her to be the first VTuber, that title is generally given to the first one to be mocapped and first to coin the actual term, Kizuna AI, <a href=\"https://en.wikipedia.org/wiki/Virtual_YouTuber#History\">in November 2016</a>. For the next couple years, more regularly appeared, though largely confined to the Japanese internet, followed by the rest of East/SE Asia. At some point, there was a definite shift in the format of content, from short (&lt;10 min) edited vlogs and occasional gameplay clips, to almost entirely livestreams as talent agencies like Nijisanji and Hololive formed and flooded the market with new characters every few months.</p>\n<p>2020 was the real turning point. When a pandemic delays dozens of new anime &amp; games (for completely understandable reasons), and leaves people stuck at home with fewer connections and lots of free time, what are otaku to do? Get into these anime girls pushing out content like there’s no tomorrow, language barrier be damned. Subtitled clip channels (often with translations that were shoddy to say the least) started to make a killing. People started looking into the tech, getting their own models, and hopping in, even on Twitch where more English streamers are. And the rest is recent history.</p>\n<p>I admit there was a time when I got so into it (or at least the idea of finding a few that I liked best) that I subbed to 50+ VTubers across Holo, Niji, and various indies in an effort to tailor my recommendations. I had a spreadsheet. A goddamn spreadsheet. After a month or so I realized I was only maybe watching 5 or 6 of them, and staying subbed to the rest would lower their mystical YT algorithm rankings if I didn’t watch them, so I dropped off, as with so many of my other fixations. But they’ve been around long enough now that I’ve noticed some…quirks about the whole thing that seem unique in the broader landscape of internet sociology. If there is research about social media, why can’t there be research about this, beyond mildly exoticizing articles about the latest quirky Japanese fad? This post, is not that research paper. I don’t think I’m the person to do that. I just want to talk about a few things. So here we go.</p>\n<h2 id=\"whats-the-deal-with-graduation-anyway\">What’s the deal with ‘graduation’, anyway?</h2>\n<p>No doubt a major theme in the next year or so, and a reality that fans have to face, is the concept of their favorite talent retiring from streaming/uploading, or &ldquo;graduation&rdquo;. The term <a href=\"https://www.reddit.com/r/jpop/comments/58ehv0/what_do_they_mean_by_graduated_in_jpop/\">originates in the J-pop idol industry</a>, where it effectively signifies a performer moving on to bigger and better things by leaving a group, at least in theory, and allows their agency to put on one big farewell show (and clean house with merch in the process). The idea of marketing a concert as the &ldquo;last ever&rdquo; surely isn’t new to fans of many classic bands. But when it comes to VTubers and the handling of this process by their corporate managers, things get a little…interesting.</p>\n<p>See, there are many reasons a traditional idol might graduate, sometimes on good terms, and other times not. Usually this is just personal factors like wanting a career change or to start a family, but it also unfortunately could include abuse by managers or stalking by fans. But one of the most common is simply leaving a group to start a solo music career, where fans clearly are given a path to follow. But at least for Hololive, the top dog in the market on YouTube, here’s what happens: Their entire channel gets deleted the moment their final stream concludes. Every video, every comment, every memory. Their parent company Cover doesn’t take particularly kindly to full stream reuploads, either.</p>\n<p>With all due respect, what is the reasoning for this? I’m only left to guess. Unlike &ldquo;real&rdquo; pop stars, they don’t exactly visibly age, so they could stick around a lot longer if they wanted to. Is it to reduce embarassment for the talent if years later they look back on their old channel with regret? Probably not that, although as a creator I would certainly understand. No, it has to be something the company does to cover (heh) its own behind. Regardless of the reason, it certainly creates a chilling effect because fans often get a week or less notice (although this is probably just to avoid an early announcement stifling subscriber growth and donations). It’s not easy for anyone.</p>\n<p>I would be remiss if I didn’t mention the graduations that occurred under not so benevolent circumstances. The most high profile sendoffs for one of the biggest VTubers on the planet occurred on July 1, 2021, when Holo member Kiryu Coco performed to nearly 500,000 live viewers and raised thousands in Super Chat donations (although <a href=\"https://www.youtube.com/channel/UCS9uQI-jC3DE0L4IpXyvr6w\">her channel does remain</a> as of this writing). Back in September 2020, in a co-stream with fellow member Akai Haato, a list of subscribers by country was displayed, among them being a flag for Taiwan (the data, it’s worth noting, was taken directly from YouTube’s stats page). Almost immediately the outcry from some Chinese viewers was immense across Coco and various other members’ Bilibili pages and YouTube live chat, and in the subsequent weeks Cover put out an apologetic press release, both streamers were &ldquo;suspended&rdquo; for three weeks, and it eventually cascaded in the company’s entire fledgling Chinese division being retired, for no fault of their own. Despite valiant efforts to increase moderation, regular incursions of irate chat spam never fully died down for Coco after this, so the announcement of her departure was not entirely unexpected, even though she denied this as a primary reason. Sifting through <a href=\"https://virtualyoutuber.fandom.com/wiki/Category:Retired\">wiki pages of graduated VTubers</a> shows everything from benign personal reasons, to doxxing and harassment, to the ever-ominous &ldquo;breach of contract&rdquo;.</p>\n<p>Even if your favorite actor stops making new movies, you’ll still have the DVDs. Even if your favorite band breaks up, you’ll always have the records, the T-shirts, and the memories. All you can do is be ready for the inevitable, and enjoy while you can.</p>\n<!-- raw HTML omitted -->\n<p><em>Don&rsquo;t forget the good times&hellip;</em></p>\n<h2 id=\"ownership-of-identity\">Ownership of identity</h2>\n<p>One of the hairier aspects of performing under a constructed character, in our IP-driven society, is who exactly owns it. In VTuber parlance it’s not uncommon to refer to one’s illustrator and model rigger affectionately as &ldquo;mama/papa&rdquo;, but for others it’s clearly just a business relationship. It’s possible to get screwed by copyright law, as <a href=\"https://www.theverge.com/2020/11/24/21591488/projekt-melody-twitch-ban-copyright-strike-digitrevx-vtuber\">Project Melody did last year</a> when her commissioned modeler used DMCA strikes to take down her Twitch channel for a day. This was shortly before the debut of Vshojo, a production company for Twitch VTubers that claims to <a href=\"https://www.vshojo.com/faqs/\">operate more as an affiliation of semi-independent streamers</a> than a talent agency that ultimately has final say on public appearances, and owns all the IP outright.</p>\n<p>I realize a lot of this is cultural differences, and I’m not trying to make value judgements about either management style. With the numbers even the smallest Holo members rake in, they’re probably getting a sweet deal no matter what the revenue split is. Just as a creator, I’d rather take my chances to own my own platform and brand. But pushing half a million subs before your first stream, maybe that’s worth it for some.</p>\n<h2 id=\"okay-so-why-anime-girls\">Okay, so why anime girls?</h2>\n<p>It’s just real-time motion capture, it could be anything. The fact that the scene is almost universally traditional bishoujo is usually explained away by the aforementioned idol roots, or the male dominance of the core fanbase. Doesn’t help that the idol paradigm is so ingrained that Hololive separates all their male talent off into Holostars, and Vshojo has, well, shōjo (girl) in the name, though it’s unclear how much they’ll stick to that. Since some of the biggest VTubers on the Japanese side (particularly in Nijisanji) are male, and English streamers (some more jokingly than others) make their virtual debuts, it’s possible the gender gap in this subculture will narrow; on the other hand, maybe it hasn’t really happened because having a space where female streamers are welcomed for reasons <a href=\"https://www.polygon.com/2020/9/14/21436437/pokimane-imane-anys-twitch-vtubing-vtuber-anime-livestream-mainstream-popularity\">other than looks or sex appeal</a> is a good thing.</p>\n<p>In general since reach grows through fanart, virality, and first impressions, a design that’s cute/cool to look at while being relatively easy to render is a safe bet over really going photorealistic or abstract with the models. But there is a rarely-explored frontier for experimentation: voice. Considering the constraints that voice range puts on the characters that most VTubers can inhabit, it’s surprising I haven’t seen more stock put into alternative voices. I know of a few VTubers that use voice changers, and at least one other (Zentreya) that uses a regular old text-to-speech engine. And OK, I considered going the latter route myself last year, before getting wrapped up in the legalese of decent TTS voices that won’t risk being sued for commercial use (hard to find, as it turns out, and who wants to be Microsoft Sam?). Considering the proportion of trans VTubers I know, voice modulation seems like a really cool frontier for trying on a new identity. On the other hand, part of the appeal of VTubers is it’s a mask, in some cases a character, that converses like a real person, so modulating to a point of unrecognizability might have an effect on viewer engagement.</p>\n<p>Streamers with a disability also could benefit wonderfully from VTuber tech, since a virtual face can be pre-programmed with expressions triggered with a keypress, and combined with a text-to-speech voice or just posting in chat there’s almost no disadvantage from other streamers!</p>\n<h2 id=\"lore-as-fiction-development\">&ldquo;Lore&rdquo; as fiction development</h2>\n<p>When I was in the peak of the fixation, I noticed that the &ldquo;lore&rdquo; if you will of many VTubers tends to shift from what characterization there was at their debut. I developed the idea of a VTuber that was some kind of interdimensional traveler, allowing for as much or as little backstory as possibly by just saying they lost some memories in the transfer. Their origin story could be expanded as much as a whole fictional universe, exciting for the avid SF/F reader and casual worldbuilding fan that I am. It even allows for other characters from that universe to be added later on as their own VTubers. Pretty neat, eh? Unfortunately, I’m just too shy and have too little privacy in my living situation to be a streamer that could pull something like this off, but it does get me thinking. What’s to stop existing, actual fictional characters from streaming?</p>\n<p>There is some precendent for it, as it turns out. Because this gold rush could only come out of the strangest timeline, <a href=\"https://www.crunchyroll.com/anime-news/2021/04/24/join-yugiri-from-zombie-land-saga-for-a-drink-as-she-hosts-vtuber-bar-session\">the actual voice actor</a> for Yugiri from certified trans-rights anime series Zombieland Saga did it. I suppose the reason this kind of thing hasn’t been done much is the limitations it places on a performer to just be themselves, at a certain point it stops being VTubing and starts just being acting. It was a neat idea, at least.</p>\n<h2 id=\"financial-barriers-and-pre-debut\">Financial barriers and ‘pre-debut’</h2>\n<p>Lord help me, I’m wading into Drama Twitter for this one.</p>\n<p>With VTubers being more popular than ever, more people naturally want to imitate their favorite personality…and then they realize the upfront cost. Countless online artists now accept commissions for models, with costs ranging from the low hundreds to a few thousand dollars depending on detail. For 3D, double the rigging cost, and add on essentially a barebones VR setup with motion trackers, on top of the reasonably beefy streaming PC needed to render your face and the game (or whatever you stream). Easy to put &ldquo;pre-debut&rdquo; in your Twitter bio, especially when half the job is being on bird site already. Isn’t that enough, if you’re working hard to either scrounge up the cash or draw and rig something up yourself?</p>\n<p>A model is an investment with massive potential for returns through donations, brand deals and merch, not to mention a time-consuming work of art, so the upfront cost isn’t exactly unjustified. As with most things tweet, a few provocative voices can spoil the whole bunch. A lot of the hate &ldquo;pre-debuts&rdquo; get looks like gatekeeping based on some characteristics of supposedly &ldquo;real VTubers&rdquo;, but the real reason is probably simpler than that (if a little entrepreneurial). Streaming is a cutthroat game, a saturated market. The legacy fanbase only has so much time to watch streams, so your output has to stand out every day, and not everyone realizes what that takes. That doesn’t mean don’t try, just block the haters and set your expectations properly: it doesn’t matter if you have 5 viewers or 500, have fun and don’t count on making a living on it until you are.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Like many things the pandemic propelled (for better or worse), this is no ‘fad’ that’s going away any time soon, because for all the dystopian shudders the VR &ldquo;metaverse&rdquo; inspires, it may very well end up playing into the future of all this. I didn’t even bring up the VRChat streaming scene, which has a history all its own that just recently collided with the VTubing tsunami. The doors it opens up for gender exploration and disability access seem limitless, and I can only hope they will remain driving forces over the more transparently capitalistic ones. Because who knows, one day actual AI streamers may arrive, and they might not be created just to entertain.</p>\n<p><em>Update: <a href=\"https://kotaku.com/neuro-sama-twitch-vtuber-ban-holocaust-minecraft-ai-1849977269\">wow what a surprise</a></em></p>\n<hr>\n<p>Hey, it’s been a while…again. I continue to be busy with figuring shit out at uni and well, that doesn’t exactly leave my brain in a good place to write. This piece was inspired by an inkling that I’ve had that VTuber circles have so many unspoken rules that they really ought to be researched almost from a sociological or ethnographic perspective, and explained to the wider world from a perspective that takes it more seriously than &ldquo;look at the latest wacky trend from Japan&rdquo;. Didn’t exactly turn out like I expected, it’s a jumbled mess, but that’s fine, I think of anything I write for this site as an ongoing draft that I might circle back to. It’s the magic of hypertext!</p>\n<p>Till next time,</p>\n<p>Lia</p>\n",
				"content_text": "<img src=\"uploads/2023/d73a3f7e8d.png\" width=\"600\" height=\"337\" alt=\"Cover - Silhouettes of five V-tubers\" />\n\n**Originally published Nov 13, 2021**\n\nThe term \"celebrity\" usually brings to mind famous faces, usually actors, musicians, comedians, people whose work necessarily means exposing some aspect of their likeness to the world. This often means egregious invasions of privacy are not uncommon in this crowd, through paparazzi, leaked private photos and conversations, and so on. This isn’t always bad, particularly when it reveals real harmful acts toward others that otherwise would not have come to light. But in general, for people who gain visible fame (in the US anyway), it just takes the form of putting on disguises to go to the gym and watching for cameras/mics around every turn; a daily reminder of people’s obsessive need to understand the person behind the mask.\n\nInternet celebrity presents somewhat of a new paradigm, with content creators that, while still commercializing their likeness and giving up privacy for a living, through regular fan interactions they reduce the perception of perfection, paving the way for parasociality. The spectrum ranges from Instagram influencers at perhaps the most distant and traditional in their approach to fame, to YouTubers interacting with commenters to influence the direction of their next video, and finally streamers chatting with viewers in near real-time. Add in the expectation of regular Twitter updates and off the cuff quips, and you’ve got a powerful engine for thousands of fans not just considering you an idol, but a friend (and all the risks that come with that).\n\nGaining enough followers to be a full-time streamer takes work, though, and it’s not something most people can afford to drop everything and do, not to mention the risk of having your real name and future career tarnished if you mess up bad online. It sure would be nice to be able to try out being an online entertainer while retaining a certain amount of privacy. You could just stream or write videos under a pseudonym and not show your face, but then a certain degree of nuance is lost without the audience seeing your candid reactions. It also would be nice to have some tried-and-true formulas for content, and a built-in audience when starting out. Enter VTubing.\n## History time\nFor those not in the know, here’s a quick rundown of the history of virtual YouTubing, or vlogging/streaming with a motion capture avatar. As early as 2011, a YouTuber named Ami Yamato was publishing animated vlogs; while some consider her to be the first VTuber, that title is generally given to the first one to be mocapped and first to coin the actual term, Kizuna AI, [in November 2016](https://en.wikipedia.org/wiki/Virtual_YouTuber#History). For the next couple years, more regularly appeared, though largely confined to the Japanese internet, followed by the rest of East/SE Asia. At some point, there was a definite shift in the format of content, from short (<10 min) edited vlogs and occasional gameplay clips, to almost entirely livestreams as talent agencies like Nijisanji and Hololive formed and flooded the market with new characters every few months.\n\n2020 was the real turning point. When a pandemic delays dozens of new anime & games (for completely understandable reasons), and leaves people stuck at home with fewer connections and lots of free time, what are otaku to do? Get into these anime girls pushing out content like there’s no tomorrow, language barrier be damned. Subtitled clip channels (often with translations that were shoddy to say the least) started to make a killing. People started looking into the tech, getting their own models, and hopping in, even on Twitch where more English streamers are. And the rest is recent history.\n\nI admit there was a time when I got so into it (or at least the idea of finding a few that I liked best) that I subbed to 50+ VTubers across Holo, Niji, and various indies in an effort to tailor my recommendations. I had a spreadsheet. A goddamn spreadsheet. After a month or so I realized I was only maybe watching 5 or 6 of them, and staying subbed to the rest would lower their mystical YT algorithm rankings if I didn’t watch them, so I dropped off, as with so many of my other fixations. But they’ve been around long enough now that I’ve noticed some…quirks about the whole thing that seem unique in the broader landscape of internet sociology. If there is research about social media, why can’t there be research about this, beyond mildly exoticizing articles about the latest quirky Japanese fad? This post, is not that research paper. I don’t think I’m the person to do that. I just want to talk about a few things. So here we go.\n## What’s the deal with ‘graduation’, anyway?\nNo doubt a major theme in the next year or so, and a reality that fans have to face, is the concept of their favorite talent retiring from streaming/uploading, or \"graduation\". The term [originates in the J-pop idol industry](https://www.reddit.com/r/jpop/comments/58ehv0/what_do_they_mean_by_graduated_in_jpop/), where it effectively signifies a performer moving on to bigger and better things by leaving a group, at least in theory, and allows their agency to put on one big farewell show (and clean house with merch in the process). The idea of marketing a concert as the \"last ever\" surely isn’t new to fans of many classic bands. But when it comes to VTubers and the handling of this process by their corporate managers, things get a little…interesting.\n\nSee, there are many reasons a traditional idol might graduate, sometimes on good terms, and other times not. Usually this is just personal factors like wanting a career change or to start a family, but it also unfortunately could include abuse by managers or stalking by fans. But one of the most common is simply leaving a group to start a solo music career, where fans clearly are given a path to follow. But at least for Hololive, the top dog in the market on YouTube, here’s what happens: Their entire channel gets deleted the moment their final stream concludes. Every video, every comment, every memory. Their parent company Cover doesn’t take particularly kindly to full stream reuploads, either.\n\nWith all due respect, what is the reasoning for this? I’m only left to guess. Unlike \"real\" pop stars, they don’t exactly visibly age, so they could stick around a lot longer if they wanted to. Is it to reduce embarassment for the talent if years later they look back on their old channel with regret? Probably not that, although as a creator I would certainly understand. No, it has to be something the company does to cover (heh) its own behind. Regardless of the reason, it certainly creates a chilling effect because fans often get a week or less notice (although this is probably just to avoid an early announcement stifling subscriber growth and donations). It’s not easy for anyone.\n\nI would be remiss if I didn’t mention the graduations that occurred under not so benevolent circumstances. The most high profile sendoffs for one of the biggest VTubers on the planet occurred on July 1, 2021, when Holo member Kiryu Coco performed to nearly 500,000 live viewers and raised thousands in Super Chat donations (although [her channel does remain](https://www.youtube.com/channel/UCS9uQI-jC3DE0L4IpXyvr6w) as of this writing). Back in September 2020, in a co-stream with fellow member Akai Haato, a list of subscribers by country was displayed, among them being a flag for Taiwan (the data, it’s worth noting, was taken directly from YouTube’s stats page). Almost immediately the outcry from some Chinese viewers was immense across Coco and various other members’ Bilibili pages and YouTube live chat, and in the subsequent weeks Cover put out an apologetic press release, both streamers were \"suspended\" for three weeks, and it eventually cascaded in the company’s entire fledgling Chinese division being retired, for no fault of their own. Despite valiant efforts to increase moderation, regular incursions of irate chat spam never fully died down for Coco after this, so the announcement of her departure was not entirely unexpected, even though she denied this as a primary reason. Sifting through [wiki pages of graduated VTubers](https://virtualyoutuber.fandom.com/wiki/Category:Retired) shows everything from benign personal reasons, to doxxing and harassment, to the ever-ominous \"breach of contract\".\n\nEven if your favorite actor stops making new movies, you’ll still have the DVDs. Even if your favorite band breaks up, you’ll always have the records, the T-shirts, and the memories. All you can do is be ready for the inevitable, and enjoy while you can.\n\n<img src=\"uploads/2023/22de6206a4.png\" width=\"600\" height=\"340\" alt=\"Screencaps from Nekomata Okayu stream. Text: Someday...when the existence of 'Nekomata Okayu' disappears from our daily lives, Please don't forget me\" />\n\n*Don't forget the good times...*\n\n## Ownership of identity\nOne of the hairier aspects of performing under a constructed character, in our IP-driven society, is who exactly owns it. In VTuber parlance it’s not uncommon to refer to one’s illustrator and model rigger affectionately as \"mama/papa\", but for others it’s clearly just a business relationship. It’s possible to get screwed by copyright law, as [Project Melody did last year](https://www.theverge.com/2020/11/24/21591488/projekt-melody-twitch-ban-copyright-strike-digitrevx-vtuber) when her commissioned modeler used DMCA strikes to take down her Twitch channel for a day. This was shortly before the debut of Vshojo, a production company for Twitch VTubers that claims to [operate more as an affiliation of semi-independent streamers](https://www.vshojo.com/faqs/) than a talent agency that ultimately has final say on public appearances, and owns all the IP outright.\n\nI realize a lot of this is cultural differences, and I’m not trying to make value judgements about either management style. With the numbers even the smallest Holo members rake in, they’re probably getting a sweet deal no matter what the revenue split is. Just as a creator, I’d rather take my chances to own my own platform and brand. But pushing half a million subs before your first stream, maybe that’s worth it for some.\n## Okay, so why anime girls?\nIt’s just real-time motion capture, it could be anything. The fact that the scene is almost universally traditional bishoujo is usually explained away by the aforementioned idol roots, or the male dominance of the core fanbase. Doesn’t help that the idol paradigm is so ingrained that Hololive separates all their male talent off into Holostars, and Vshojo has, well, shōjo (girl) in the name, though it’s unclear how much they’ll stick to that. Since some of the biggest VTubers on the Japanese side (particularly in Nijisanji) are male, and English streamers (some more jokingly than others) make their virtual debuts, it’s possible the gender gap in this subculture will narrow; on the other hand, maybe it hasn’t really happened because having a space where female streamers are welcomed for reasons [other than looks or sex appeal](https://www.polygon.com/2020/9/14/21436437/pokimane-imane-anys-twitch-vtubing-vtuber-anime-livestream-mainstream-popularity) is a good thing.\n\nIn general since reach grows through fanart, virality, and first impressions, a design that’s cute/cool to look at while being relatively easy to render is a safe bet over really going photorealistic or abstract with the models. But there is a rarely-explored frontier for experimentation: voice. Considering the constraints that voice range puts on the characters that most VTubers can inhabit, it’s surprising I haven’t seen more stock put into alternative voices. I know of a few VTubers that use voice changers, and at least one other (Zentreya) that uses a regular old text-to-speech engine. And OK, I considered going the latter route myself last year, before getting wrapped up in the legalese of decent TTS voices that won’t risk being sued for commercial use (hard to find, as it turns out, and who wants to be Microsoft Sam?). Considering the proportion of trans VTubers I know, voice modulation seems like a really cool frontier for trying on a new identity. On the other hand, part of the appeal of VTubers is it’s a mask, in some cases a character, that converses like a real person, so modulating to a point of unrecognizability might have an effect on viewer engagement.\n\nStreamers with a disability also could benefit wonderfully from VTuber tech, since a virtual face can be pre-programmed with expressions triggered with a keypress, and combined with a text-to-speech voice or just posting in chat there’s almost no disadvantage from other streamers!\n## \"Lore\" as fiction development\nWhen I was in the peak of the fixation, I noticed that the \"lore\" if you will of many VTubers tends to shift from what characterization there was at their debut. I developed the idea of a VTuber that was some kind of interdimensional traveler, allowing for as much or as little backstory as possibly by just saying they lost some memories in the transfer. Their origin story could be expanded as much as a whole fictional universe, exciting for the avid SF/F reader and casual worldbuilding fan that I am. It even allows for other characters from that universe to be added later on as their own VTubers. Pretty neat, eh? Unfortunately, I’m just too shy and have too little privacy in my living situation to be a streamer that could pull something like this off, but it does get me thinking. What’s to stop existing, actual fictional characters from streaming?\n\nThere is some precendent for it, as it turns out. Because this gold rush could only come out of the strangest timeline, [the actual voice actor](https://www.crunchyroll.com/anime-news/2021/04/24/join-yugiri-from-zombie-land-saga-for-a-drink-as-she-hosts-vtuber-bar-session) for Yugiri from certified trans-rights anime series Zombieland Saga did it. I suppose the reason this kind of thing hasn’t been done much is the limitations it places on a performer to just be themselves, at a certain point it stops being VTubing and starts just being acting. It was a neat idea, at least.\n## Financial barriers and ‘pre-debut’\nLord help me, I’m wading into Drama Twitter for this one.\n\nWith VTubers being more popular than ever, more people naturally want to imitate their favorite personality…and then they realize the upfront cost. Countless online artists now accept commissions for models, with costs ranging from the low hundreds to a few thousand dollars depending on detail. For 3D, double the rigging cost, and add on essentially a barebones VR setup with motion trackers, on top of the reasonably beefy streaming PC needed to render your face and the game (or whatever you stream). Easy to put \"pre-debut\" in your Twitter bio, especially when half the job is being on bird site already. Isn’t that enough, if you’re working hard to either scrounge up the cash or draw and rig something up yourself?\n\nA model is an investment with massive potential for returns through donations, brand deals and merch, not to mention a time-consuming work of art, so the upfront cost isn’t exactly unjustified. As with most things tweet, a few provocative voices can spoil the whole bunch. A lot of the hate \"pre-debuts\" get looks like gatekeeping based on some characteristics of supposedly \"real VTubers\", but the real reason is probably simpler than that (if a little entrepreneurial). Streaming is a cutthroat game, a saturated market. The legacy fanbase only has so much time to watch streams, so your output has to stand out every day, and not everyone realizes what that takes. That doesn’t mean don’t try, just block the haters and set your expectations properly: it doesn’t matter if you have 5 viewers or 500, have fun and don’t count on making a living on it until you are.\n## Conclusion\nLike many things the pandemic propelled (for better or worse), this is no ‘fad’ that’s going away any time soon, because for all the dystopian shudders the VR \"metaverse\" inspires, it may very well end up playing into the future of all this. I didn’t even bring up the VRChat streaming scene, which has a history all its own that just recently collided with the VTubing tsunami. The doors it opens up for gender exploration and disability access seem limitless, and I can only hope they will remain driving forces over the more transparently capitalistic ones. Because who knows, one day actual AI streamers may arrive, and they might not be created just to entertain.\n\n*Update: [wow what a surprise](https://kotaku.com/neuro-sama-twitch-vtuber-ban-holocaust-minecraft-ai-1849977269)*\n\n---\nHey, it’s been a while…again. I continue to be busy with figuring shit out at uni and well, that doesn’t exactly leave my brain in a good place to write. This piece was inspired by an inkling that I’ve had that VTuber circles have so many unspoken rules that they really ought to be researched almost from a sociological or ethnographic perspective, and explained to the wider world from a perspective that takes it more seriously than \"look at the latest wacky trend from Japan\". Didn’t exactly turn out like I expected, it’s a jumbled mess, but that’s fine, I think of anything I write for this site as an ongoing draft that I might circle back to. It’s the magic of hypertext!\n\nTill next time,\n\nLia\n",
				"date_published": "2023-01-18T10:00:00-07:00",
				"url": "https://library.emiabo.com/2023/01/18/vtubers-and-famous.html",
				"tags": ["essay"]
			},
			{
				"id": "http://emiabo.micro.blog/2023/01/15/helllloooo-microblog-im.html",
				
				"content_html": "<p>Helllloooo Micro.blog! I’m Lia, and I enjoy writing about 📺 anime, 🎮 games, 📽 movies, 📚 books, and miscellaneous tech topics. I’m relaunching my blog here, so keep an eye out for my posts this week, including a new essay about my thoughts on the AI art 🎨 craze.</p>\n<p>(For my followers on Mastodon and Tumblr, I’ll try to only cross post longform articles)</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Helllloooo Micro.blog! I’m Lia, and I enjoy writing about 📺 anime, 🎮 games, 📽 movies, 📚 books, and miscellaneous tech topics. I’m relaunching my blog here, so keep an eye out for my posts this week, including a new essay about my thoughts on the AI art 🎨 craze.\n\n(For my followers on Mastodon and Tumblr, I’ll try to only cross post longform articles)\n\n<img src=\"uploads/2023/d8bed8c408.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-01-15T16:34:31-07:00",
				"url": "https://library.emiabo.com/2023/01/15/helllloooo-microblog-im.html"
			}
	]
}
